ABOSTM/Arduino_Core_STM32/variants/STM32G0xx/Generic_G031Kx/variant.h
/*
 *******************************************************************************
 * Copyright (c) 2021, STMicroelectronics
 * All rights reserved.
 *
 * This software component is licensed by ST under BSD 3-Clause license,
 * the "License"; You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                        opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */
#if !defined(ARDUINO_GENERIC_G031K4) && !defined(ARDUINO_GENERIC_G031K6) && !defined(ARDUINO_GENERIC_G031K8)
#include "variant_NUCLEO_G031K8.h"
#else
#ifndef _VARIANT_ARDUINO_STM32_
#define _VARIANT_ARDUINO_STM32_
#ifdef __cplusplus
extern "C" {
#endif // __cplusplus

/*----------------------------------------------------------------------------
 *        STM32 pins number
 *----------------------------------------------------------------------------*/
#define PA0                     A0
#define PA1                     A1
#define PA2                     A2
#define PA3                     A3
#define PA4                     A4
#define PA5                     A5
#define PA6                     A6
#define PA7                     A7
#define PA8                     8
#define PA9                     9
#define PA10                    10
#define PA11                    A8
#define PA12                    A9
#define PA13                    A10
#define PA14                    A11
#define PA15                    15
#define PB0                     A12
#define PB1                     A13
#define PB2                     A14
#define PB3                     19
#define PB4                     20
#define PB5                     21
#define PB6                     22
#define PB7                     A15
#define PB8                     24
#define PB9                     25
#define PC6                     26
#define PC14                    27
#define PC15                    28
#define PF2                     29
#define PA9_R                   30
#define PA10_R                  31

// Alternate pins number
#define PA2_ALT1                (PA2 | ALT1)
#define PA3_ALT1                (PA3 | ALT1)
#define PA6_ALT1                (PA6 | ALT1)
#define PA7_ALT1                (PA7 | ALT1)
#define PA7_ALT2                (PA7 | ALT2)
#define PA7_ALT3                (PA7 | ALT3)
#define PB0_ALT1                (PB0 | ALT1)
#define PB1_ALT1                (PB1 | ALT1)
#define PB1_ALT2                (PB1 | ALT2)
#define PB3_ALT1                (PB3 | ALT1)
#define PB6_ALT1                (PB6 | ALT1)
#define PC6_ALT1                (PC6 | ALT1)

#define NUM_DIGITAL_PINS        32
#define NUM_REMAP_PINS          2
#define NUM_ANALOG_INPUTS       16

// On-board LED pin number
#ifndef LED_BUILTIN
#define LED_BUILTIN             PC6
#endif

// On-board user button
#ifndef USER_BTN
#define USER_BTN                PF2
#endif

// SPI definitions
#ifndef PIN_SPI_SS
#define PIN_SPI_SS              PB0
#endif
#ifndef PIN_SPI_SS1
#define PIN_SPI_SS1             PB9
#endif
#ifndef PIN_SPI_SS2
#define PIN_SPI_SS2             PA4
#endif
#ifndef PIN_SPI_SS3
#define PIN_SPI_SS3             PA8
#endif
#ifndef PIN_SPI_MOSI
#define PIN_SPI_MOSI            PB5
#endif
#ifndef PIN_SPI_MISO
#define PIN_SPI_MISO            PB4
#endif
#ifndef PIN_SPI_SCK
#define PIN_SPI_SCK             PB3
#endif

// I2C definitions
#ifndef PIN_WIRE_SDA
#define PIN_WIRE_SDA            PA10
#endif
#ifndef PIN_WIRE_SCL
#define PIN_WIRE_SCL            PA9
#endif

// Timer Definitions
#ifndef TIMER_TONE
#define TIMER_TONE              TIM14
#endif
#ifndef TIMER_SERVO
#define TIMER_SERVO             TIM16
#endif

// UART Definitions
#ifndef SERIAL_UART_INSTANCE
#define SERIAL_UART_INSTANCE    101
#endif

// Default pin used for generic 'Serial' instance
// Mandatory for Firmata
#ifndef PIN_SERIAL_RX
#define PIN_SERIAL_RX           PA3
#endif
#ifndef PIN_SERIAL_TX
#define PIN_SERIAL_TX           PA2
#endif

#ifdef __cplusplus
} // extern "C"
#endif

/*----------------------------------------------------------------------------
 *        Arduino objects - C++ only
 *----------------------------------------------------------------------------*/

#ifdef __cplusplus
  // These serial port names are intended to allow libraries and architecture-neutral
  // sketches to automatically default to the correct port name for a particular type
  // of use.  For example, a GPS module would normally connect to SERIAL_PORT_HARDWARE_OPEN,
  // the first hardware serial port whose RX/TX pins are not dedicated to another use.
  //
  // SERIAL_PORT_MONITOR        Port which normally prints to the Arduino Serial Monitor
  //
  // SERIAL_PORT_USBVIRTUAL     Port which is USB virtual serial
  //
  // SERIAL_PORT_LINUXBRIDGE    Port which connects to a Linux system via Bridge library
  //
  // SERIAL_PORT_HARDWARE       Hardware serial port, physical RX & TX pins.
  //
  // SERIAL_PORT_HARDWARE_OPEN  Hardware serial ports which are open for use.  Their RX & TX
  //                            pins are NOT connected to anything by default.
  #define SERIAL_PORT_MONITOR   Serial
  #define SERIAL_PORT_HARDWARE  Serial
#endif

#endif /* _VARIANT_ARDUINO_STM32_ */
#endif /* ARDUINO_GENERIC_* */
